/*猪猪Hanke特别喜欢吃烤鸡（本是同畜牲，相煎何太急！）Hanke吃鸡很特别，为什么特别呢？因为他有10种配料（芥末、孜然等），
 *每种配料可以放1—3克，任意烤鸡的美味程度为所有配料质量之和
 *现在，Hanke想要知道，如果给你一个美味程度，请输出这10种配料的所有搭配方案
 *输入格式
 *一行,n<=5000
 *输出格式
 *第一行，方案总数
 *第二行至结束，10个数，表示每种配料所放的质量
 *按字典序排列。
 *如果没有符合要求的方法，就只要在第一行输出一个“0”
 * 输入输出样例
 *输入 #1 复制
 *11
 *输出 #1 复制
 *10
 *1 1 1 1 1 1 1 1 1 2 
 *1 1 1 1 1 1 1 1 2 1 
 *1 1 1 1 1 1 1 2 1 1 
 *1 1 1 1 1 1 2 1 1 1 
 *1 1 1 1 1 2 1 1 1 1 
 *1 1 1 1 2 1 1 1 1 1 
 *1 1 1 2 1 1 1 1 1 1 
 *1 1 2 1 1 1 1 1 1 1 
 *1 2 1 1 1 1 1 1 1 1 
 *2 1 1 1 1 1 1 1 1 1 
*/
#include <stdio.h>

int n, ans = 0;
int a2[10001][10], a[10];
void test(int no, int m) { // (第n中调料，美味程度)
    if (no > 9) {  // 当尝试的配料大于10种，判断现有的是否符合
        if (m == n) {
            for (int i = 0; i < 10; i++) {
                a2[ans][i] = a[i];  // 储存答案
            }
            ans++;
        }
        return;
    }
    for (int i = 1; i <= 3; i++) {
        if ((m + i) > n) break;
        a[no] = i;
        test(no + 1, m + i);
        a[no] = 0;
    }
}

int main() {
    scanf("%d", & n);
    if (n < 10 || n > 30)
        printf("0");
    else {
        test(0, 0);
        printf("%d\n", ans);
        for (int i = 0; i < ans; i++) {
            for (int j = 0; j < 10; j++) {
                printf("%d ", a2[i][j]);
            }
            printf("\n");
        }
    }

    return 0;
}